Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.AddCut(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Transform)
add modifier definition
elemId:
parent element id
trf:
transformation matrix
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.AddHole(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Transform)
add modifier definition
elemId:
parent element id
loop:
polyline
extrusionVector:
extrusion vector
trf:
transformation matrix
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.AddOpening(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Transform)
add modifier definition
elemId:
parent element id
loop:
polyline
extrusionVector:
extrusion vector
trf:
transformation matrix
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.AddShape(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.Structure.GeomObjectType,System.String,Autodesk.Revit.DB.Transform,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
adds a piece of geometry for the connection with extra information
geometry:
geometry of an external object
type:
external object type - temporary - will chnage this to an enum
strRole:
the role of this external object
CS:
relevant CS of this external object
Axes:
special axes of this object that may be worth dimensioning
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.ConnectionId
id of the connection
Since:
2017

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData.Document
current document
Since:
2017

Autodesk.Revit.DB.Structure.SteelConnectionsServiceData
The data needed by steel connections server to transfer graphics and modifiers.
Remarks:
It's exposed in internal API.
Since:
2017